<?php

return [
    'nav' => [
        'portfolio' => 'الملف الشخصى',
        'blog' => 'المدونة',
        'lang' => 'اللغة'
    ],
    'user' => [
        'login' => 'تسجيل الدخول',
        'register' => 'انشاء حساب',
        'logout' => 'تسجيل الخروج'
    ],
    'home' => [
        'hello' => 'مرحبا, أنا ',
        'myName' => 'أحمد عادل',
        'and' => 'و أنا',
        'start' => 'إبدأ',
        'theme' => 'المظهر',
        'title' => [
            'top' => 'البداية',
            'about' => 'نبذة',
            'skill' => 'المهارات',
            'project' => 'أعمالى',
            'blog' => 'اخر المنشورات',
            'contact' => 'إتصل بى'
        ],
        'sec' => [
            'feat' => [
                'Responsive' => [
                    'title' => 'إنسيابى',
                    'txt' => 'تصميماتى تعمل على أى جهاز كبير أو صغير.'
                ],
                'Dynamic' => [
                    'title' => 'ديناميكى',
                    'txt' => 'احب ان ابنى صفحات ويب تنبض بالحياة'
                ],
                'Tested' => [
                    'title' => 'تم أختباره',
                    'txt' => ' كل خواص الموقع مجربه جيد قبل النشرا'
                ],
                'Organized' => [
                    'title' => 'منظم',
                    'icon' => 'code',
                    'txt' => 'لمساعدة غيرى من المبرمجين عند العمل على نفس المشروع'
                ],
                'Up_To_Date' => [
                    'title' => 'مُحدث',
                    'icon' => 'laptop-code',
                    'txt' => 'أستخدم دائماً آخر الإصدارات من أدواتى'
                ],
                'Multi_Language' => [
                    'title' => 'متعدد اللغات',
                    'icon' => 'language',
                    'txt' => 'جرب هذه الميزه فى هذا الموقع.'
                ],
            ],
            'skill' => [
                'info' => "مطور مواقع متخصص فى الباك إند لبناء تطبيقات الويب المعقدة. أكتب على مدونتى عن تطوير المواقع، تريد أن تعلم كيف سأحسن مشروعك؟ تحقق من ",
                'my' => '',
                'hire' => 'وظفنى'
            ],
            'proj' => [
                'client' => 'العميل'
            ],
            'blog' => [
                'date' => 'اخر تحديث',
                'c_count' => 'التعليقات'
            ],
            'con' => [
                'res' => 'سوف أقوم بالرد خلال 24 ساعة',
                'err' => 'حدث خطأ غير متوقع ، برجاء إعادة المحاولة لاحقاً',
                'success' => 'تمت العملية بنجاح',
                'btn' => 'إرسال',
                'inp' => [
                    'name' => 'الإسم',
                    'email' => 'البريد الإلكترونى',
                    'mess' => 'الرسالة'
                ],
                'vaild' => [
                    'name' => 'يجب أن يكون الإسم اقل من 120 حرف.',
                    'email' => 'من فضلك إكتب بريد إلكترونى صحيح.',
                    'mess' => 'من فضلك إكتب رسالتك'
                ]
            ]
        ]
    ],
    'cpost' => [
        'title' => 'Create Post',
        'inp' => [
            'title' => 'العنوان',
            'img' => 'الصورة',
            'body' => 'Body',
            'btn' => 'Save Post'
        ],
        'ph' => [
            'enter' => 'أدخل ',
            'file' => 'إختر ملفاً'
        ],
        'vaild' => [
            'titleReq' => 'The Title must be greater than 15 characters.',
            'imgType' => 'The Image must be a file of type: png, jpg, jpeg.',
            'imgSize' => 'The Image must be less than 750 kilobytes.',
            'bodyReq' => 'The Body must be greater than 150 characters.'
        ]
    ],
    'posts' => [
        'title' => 'كل المنشورات',
        'empty' => '<strong>للأسف, </strong> لم نستطع العثور على ماتبحث عنه'
    ],
    'shpost' => [
        'home' => 'الرئيسية',
        'c' => [
            'title' => 'إترك تعليقاً',
            'success' => 'تم إضافة تعليقك',
            'btn' => 'أضف تعليق'
        ]
    ],
    'sb' => [
        's' => 'البحث',
        'for' => 'عن',
        'cl' => 'تغيير التصميم',
        'gv' => 'شبكة',
        'lv' => 'قائمة',
        'classic' => 'تقليدى',
        'pop' => 'افضل المنشورات',
        'share' => [
            't' => 'إنشر هذا',
            'fb' => 'فيس بوك',
            'tw' => 'تويتر',
            'ln' => 'لينكدإن',
            'ma' => 'البريد',
            'text' => 'قم بزيارة مدونتنا'
        ],
        'cat' => 'التصنيفات'
    ]
];
